In [1]:
import pandas as pd

In [2]:
data = pd.read_csv("train-csv.csv")
data.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,NaN,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969

In [3]:
data = pd.read_csv("train-csv.csv")
data.tail()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
550063,1006033,P00372445,M,51-55,13,B,1,1,20,NaN,NaN,368
550064,1006035,P00375436,F,26-35,1,C,3,0,20,NaN,NaN,371
550065,1006036,P00375436,F,26-35,15,B,4+,1,20,NaN,NaN,137
550066,1006038,P00375436,F,55+,1,C,2,0,20,NaN,NaN,365
550067,1006039,P00371644,F,46-50,0,B,4+,1,20,NaN,NaN,490

In [4]:
import numpy as np

In [5]:
data.shape

(550068, 12)

In [6]:
data.isnull().sum()

User_ID                            0
Product_ID                         0
Gender                             0
Age                                0
Occupation                         0
City_Category                      0
Stay_In_Current_City_Years         0
Marital_Status                     0
Product_Category_1                 0
Product_Category_2            173638
Product_Category_3            383247
Purchase                           0
dtype: int64

In [7]:
data.columns

Index(['User_ID', 'Product_ID', 'Gender', 'Age', 'Occupation', 'City_Category',
       'Stay_In_Current_City_Years', 'Marital_Status', 'Product_Category_1',
       'Product_Category_2', 'Product_Category_3', 'Purchase'],
      dtype='object')

In [8]:
data.dtypes

User_ID                         int64
Product_ID                     object
Gender                         object
Age                            object
Occupation                      int64
City_Category                  object
Stay_In_Current_City_Years     object
Marital_Status                  int64
Product_Category_1              int64
Product_Category_2            float64
Product_Category_3            float64
Purchase                        int64
dtype: object

#### 1.	How do we convert "4+" in "Stay_in_current_city_years" variable  to a value of 4?

In [23]:
data['Stay_In_Current_City_Years']=data['Stay_In_Current_City_Years'].str.replace('4+', '4') 
data

<ipython-input-23-543339f6ce85>:1: FutureWarning: The default value of regex will change from True to False in a future version.
  data['Stay_In_Current_City_Years']=data['Stay_In_Current_City_Years'].str.replace('4+', '4')

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,NaN,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969
...,...,...,...,...,...,...,...,...,...,...,...,...
550063,1006033,P00372445,M,51-55,13,B,1,1,20,NaN,NaN,368
550064,1006035,P00375436,F,26-35,1,C,3,0,20,NaN,NaN,371
550065,1006036,P00375436,F,26-35,15,B,4+,1,20,NaN,NaN,137
550066,1006038,P00375436,F,55+,1,C,2,0,20,NaN,NaN,365
550067,1006039,P00371644,F,46-50,0,B,4+,1,20,NaN,NaN,490

#### 2.	How many rows exist with a marital_status = 0?

In [10]:
len(data[data["Marital_Status"]==0])

324731

#### 3.	How many rows exist within the age_group of "26-35" with a marital status =0?

In [11]:
len(data[(data['Age']=='26-35') & (data['Marital_Status']==0)])

133296

#### 4.	How many distinct users exist within the age_group of "26-35" with a marital status =0?

In [12]:
(data[(data['Age']=='26-35')  & (data['Marital_Status']==0)].value_counts().sum())

40453

In [73]:
data[('Age'=='26-35' & 'Marital_Status'==0),]
length(unique('User_ID'))

TypeError: unsupported operand type(s) for &: 'str' and 'str'

#### 5.	How many distinct age groups exist?

In [13]:
data.groupby(['Age']).sum()

,User_ID,Occupation,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
Age,,,,,,,
0-17,15143112813,132309,0,76775,96155.0,57725.0,134913183
18-25,99939196632,671348,21116,509371,654936.0,388041.0,913848675
26-35,220270500414,1734073,86291,1166945,1473278.0,846624.0,2031770578
36-45,110350311441,972225,43636,604438,750081.0,424412.0,1026569884
46-50,45846804203,389239,33011,262424,315572.0,173059.0,420843403
51-55,38615925320,339198,27662,222313,267570.0,146334.0,367099644
55+,21568218459,204346,13621,130450,147356.0,77134.0,200767375

In [14]:
len(data.groupby(['Age']).sum())

7

#### 6.	How many distinct User_IDs exist?

In [15]:
len(data.groupby(['User_ID']).sum())

5891

#### 7.	Which product_ID occurs the most frequently?

In [16]:
data['Product_ID'].mode()

0    P00265242
dtype: object

#### 8.	What is the average purchase rate of gender = f & gender = m?

In [17]:
data.groupby('Gender').Purchase.mean()

Gender
F    8734.565765
M    9437.526040
Name: Purchase, dtype: float64

#### 9.	What is the average value of purchase when gender = f or age_group = "0-17"?

In [30]:
data(data['Gender'] == 'F') or (data['Age']=='0-17').Purchase.mean()

TypeError: 'DataFrame' object is not callable

In [83]:
data[(data["Gender"]=="F"|data["Age"]=="0-17"),"Purchase"].mean()

TypeError: Cannot perform 'ror_' with a dtyped [object] array and scalar of type [bool]

In [64]:
(data['Gender'] == 'F') or (data['Age'] =='0-17')
data

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

#### 10.	What is the average value of purchase within the odd rows of train.csv?

In [69]:
def get_odd_rows(data):
    return data[[i % 2 != 0 for i in range(Puchase.shape[0])]].Purchase.mean()

#### 11.	create a new dataset (train2) that does not have any row in train.csv that has  missing value